# pandas

### pandas use cases :
    1.data transformation
    2.data analysis
    3.data cleaning
 ### pandas notation
     1.series--- creating the data
     2.dataframes---for marking the data in a particular tabular format

In [ ]:
import pandas as pd
internal1={'s1':20,'s2':10,'s3':30}
internal1=pd.Series(internal1)
print(internal1)
internal2={'s1':10,'s2':30,'s3':20}
internal2=pd.Series(internal2)
print(internal2)

In [ ]:
final={'Internal1':internal1,'Internal2':internal2}
final=pd.DataFrame(final)
print(final)

In [ ]:
student1={'naveen':45,'siva':40,'sandeep':42,'pooja':48,'mani':42}
student1=pd.Series(student1)
student2={'naveen':90,'siva':80,'sandeep':82,'pooja':98,'mani':72}
student2=pd.Series(student2)
student3={'naveen':75,'siva':80,'sandeep':92,'pooja':78,'mani':62}
student3=pd.Series(student3)

In [ ]:
final={'Maths':student1,'Computers':student2,'coding':student3}
final=pd.DataFrame(final)
final

In [ ]:
final.columns

In [ ]:
final.values

In [ ]:
final.values[2,0]

In [ ]:
final.values[2]

In [ ]:
for i in final.values:
    print(i[0] ,i[1])

In [ ]:
for i in final.values:
    print(i[0])

In [ ]:
final.loc['yeshwanth']=[10,70,30]

In [ ]:
final

In [ ]:
final.drop('yeshwanth')

In [ ]:
final.values[2]=[49,90,50]

In [ ]:
final

In [ ]:
final.max(axis=0)

In [ ]:
final.max(axis=0)

In [2]:
import pandas as pd
income=pd.read_csv("income.csv")
income

,GEOID,State,2005,2006,2007,2008,2009,2010,2011,2012,2013
0,04000US01,Alabama,37150,37952,42212,44476,39980,40933,42590,43464,41381
1,04000US02,Alaska,55891,56418,62993,63989,61604,57848,57431,63648,61137
2,04000US04,Arizona,45245,46657,47215,46914,45739,46896,48621,47044,50602
3,04000US05,Arkansas,36658,37057,40795,39586,36538,38587,41302,39018,39919
4,04000US06,California,51755,55319,55734,57014,56134,54283,53367,57020,57528

In [3]:
income.columns

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

In [4]:
income.values[3][2:]

array([36658, 37057, 40795, 39586, 36538, 38587, 41302, 39018, 39919],
      dtype=object)

In [5]:
income.values[0:][2:]

array([['04000US04', 'Arizona', 45245, 46657, 47215, 46914, 45739, 46896,
        48621, 47044, 50602],
       ['04000US05', 'Arkansas', 36658, 37057, 40795, 39586, 36538,
        38587, 41302, 39018, 39919],
       ['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
        54283, 53367, 57020, 57528]], dtype=object)

In [6]:
for i in income.values:
    print(i[1],":",i[10])

Alabama : 41381
Alaska : 61137
Arizona : 50602
Arkansas : 39919
California : 57528

In [7]:
s=0
for i in range(2,11):
    s+=income.values[2][i]
print(s)

424933

## average income of alaska in all years

In [10]:
count=0
s=0
for i in income.values[1][2:]:
    count+=1
    s=s+i
print(int(s/count))

60106

### average incoime pf all states in 2012

In [12]:
count=0
s=0
for i in income.values:
    count+=1
    s=s+i[9]
print(int(s/count))

50038

## create a function to print all columns in a single line

In [13]:
def fun():
    return income.columns
fun()

Index(['GEOID', 'State', '2005', '2006', '2007', '2008', '2009', '2010',
       '2011', '2012', '2013'],
      dtype='object')

## create afunction to accessa row based on a unique column values

In [14]:
n=int(input())
def fun(a):
    if(n<=4):
        return income.values[n]
    else:
        return 'no row'
fun(n)

4

array(['04000US06', 'California', 51755, 55319, 55734, 57014, 56134,
       54283, 53367, 57020, 57528], dtype=object)

## create a function to find average income of all states from 2015 to 2013

In [17]:
def fun3():
    a=[]
    for i in range(0,5):
        s=c=0
        for j in range(2,11):
            s=s+income.values[i][j]
            c=c+1
        print("Average income of "+income.values[i][1]+" is:",(s//c))
        a.append(s//c)
    b=len(a)
    print("Average income of all states from 2005 to 2013 is:",(sum(a)//b))
fun3()

Average income of Alabama is: 41126
Average income of Alaska is: 60106
Average income of Arizona is: 47214
Average income of Arkansas is: 38828
Average income of California is: 55350
Average income of all states from 2005 to 2013 is: 48524

In [18]:
income.values[1][2:]

array([55891, 56418, 62993, 63989, 61604, 57848, 57431, 63648, 61137],
      dtype=object)

In [19]:
def highAvg():
    y1 = 0
    y2 = 0
    y3 = 0
    for i in income.values:
        y1 += i[-3]
        y2 += i[-2]
        y3 += i[-1]
    
    y1 = y1/5
    y2 = y2/5
    y3 = y3/5
    print("Maximum average income in last three years is : ",max(y1,y2,y3))
highAvg()

Maximum average income in last three years is :  50113.4

In [20]:
def highAvg():
    y1 = 0
    y2 = 0
    y3 = 0
    y4 = 0
    for i in income.values:
        y1 += i[4]
        y2 += i[5]
        y3 += i[6]
        y4 += i[7]
        
    y1 = y1/5
    y2 = y2/5
    y3 = y3/5
    y4 = y4/5
    print(" Lowest average income in last three years is : ",min(y1,y2,y3))
    
highAvg()

 Lowest average income in last three years is :  47999.0

In [21]:
dn= {}
for i in income.values:
    dn[i[1]]=sum(i[2:])
value = dn['California']
for i in dn:
    if(dn[i]<value):
        print(i)

Alabama
Arizona
Arkansas

In [22]:
y = []
for i in income.values:
    y.append(i[6])
y.sort(reverse=True)

for item in y:
    for i in income.values:
        if(item==i[6]):
            print(i[1])

Alaska
California
Arizona
Alabama
Arkansas

In [24]:
total = []
for i in income.values:
    total.append((sum(i[2:])/5))

lowestIndex = total.index(min(total))

print(income.values[lowestIndex][1],end="")

print(" : ",min(total))

Arkansas :  69892.0